function open_menu() {

	$('.menu').toggleClass('menu_active');
	$('.menu_button').toggleClass('mbutton_active');

}

function sel_sect_1() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat1num1()">На Марківській землі (пісня)</span><br><span onclick="show_cat1num2()">В своє село вростаю серцем</span><br><span onclick="show_cat1num3()">А в мого солов’я – незрадлива душа</span><br><span onclick="show_cat1num4()">Красивий край з безмежністю степів</span><br><span onclick="show_cat1num5()">Навесні увібралась калиною</span><br><span onclick="show_cat1num6()">Вінок моєї України</span>');

}

function sel_sect_2() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat2num1()">Ранкова молитва</span><br><span onclick="show_cat2num2()">Сад</span><br><span onclick="show_cat2num4()">Зазирало небо у калюжі</span><br><span onclick="show_cat2num5()">Крізь сльози дощу посміхається заспане небо</span><br><span onclick="show_cat2num6()">Шумлять ліси</span><br><span onclick="show_cat2num7()">Зів’яли зламані айстри</span><br><span onclick="show_cat2num8()">Ромашкове</span><br><span onclick="show_cat2num9()">Пісня «Осіння»</span><br><span onclick="show_cat2num10()">Простір піснею жайвора зшитий</span>');

}

function sel_sect_3() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat3num1()">Бурштин сходу</span><br><span onclick="show_cat3num2()">У степів моїх рани глибокі</span><br><span onclick="show_cat3num3()">Ветеранам</span><br><span onclick="show_cat3num4()">Літо в степу</span>');

}

function sel_sect_4() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat4num1()">У малих долоньках помістилося літо!</span><br><span onclick="show_cat4num2()">Нам же, дітям</span><br><span onclick="show_cat4num3()">Веселка</span><br><span onclick="show_cat4num4()">На святвечір</span><br><span onclick="show_cat4num5()">Літо у долоньці</span><br><span onclick="show_cat4num6()">Соловейку у саду</span><br><span onclick="show_cat4num7()">Забарилася зима</span><br><span onclick="show_cat4num8()">Це кому вночі не спиться?</span><br><span onclick="show_cat4num9()">У калюжах – небо чисте</span><br><span onclick="show_cat4num10()">Новорічне свято</span><br><span onclick="show_cat4num11()">Біля стежки сонно-сонно</span><br><span onclick="show_cat4num12()">Лист Святому Миколаю</span><br><span onclick="show_cat4num13()">Осінь</span><br><span onclick="show_cat4num14()">Літо любить працьовитих</span><br><span onclick="show_cat4num15()">Мій друже клен</span><br><span onclick="show_cat4num16()">Подарунок від Миколая</span><br><span onclick="show_cat4num17()">За вікном хурделиця</span><br><span onclick="show_cat4num18()">Коляда!</span><br><span onclick="show_cat4num19()">Море квітів</span><br><span onclick="show_cat4num20()">Треба жити у любові (Казка)</span><br><span onclick="show_cat4num21()">Треба бути працьовитим (Казка)</span><br><span onclick="show_cat4num22()">Переддень Святого Миколая або Як Марійка з друзями Диво рятували (Казка)</span>');

}

function to_start() {

	$('.poems_list').html('<span onclick="sel_sect_1()"><span class="poem-font">"Мій милий край з безмежністю степів"</span><br>(поезія про Україну та малу батьківщину)</span> <br><span onclick="sel_sect_2()"><span class="poem-font">"Вишнева гілка стука у вікно"</span><br>(пейзажна лірика)</span> <br><span onclick="sel_sect_3()"><span class="poem-font">"Їх серця скалічені війною"</span><br>(захисникам присвячується)</span> <br><span onclick="sel_sect_4()"><span class="poem-font">"У малих долоньках помістилося літо"</span><br>(твори для дітей)</span>');
	$('.poem').html('Оберіть вірш!');

}

function show_cat1num1() {

	$('.poem').html('<span class="title-poem">На Марківській землі (пісня)</span><br>Кулинина гора, краплинки воронцеві, <br>За Марківкою ліс, а з ним межує степ… <br>І Деркула потік несе снагу Дінцеві, <br>І колоском життя на ниві проросте. <br><br>На Марківській землі джерела б’ють прозорі, <br>Сивіє ковила, а ниви золоті. <br>Над Марківщиною найяскравіші зорі. <br>Ти – найдорожча в нашому житті! <br><br>Пишатись маєм чим: від батька і до сина <br>Луганської землі ти крихта чарівна. <br>Нам першими стрічать світанок України <br>Над Марківщиною хай пісня ця луна!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat1num2() {

	$('.poem').html('<span class="title-poem">В своє село вростаю серцем</span><br>Воно піснями розцвіло,<br>Немов веселка після зливи.<br>Я все-таки люблю село,<br>Хоча яка в нім перспектива?<br><br>Хтось від’їжджає у міста,<br>Крокує в ногу із прогресом.<br>А в мене – нива золота,<br>Життя повільні тихі плеса.<br><br>Когось життя удаль несе,<br>Хтось прагне вигідних комерцій,<br>А я? А я живу, - і все,<br>В своє село вростаю серцем!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat1num3() {

	$('.poem').html('<span class="title-poem">А в мого солов’я – незрадлива душа</span><br>Хтось дитинства краї назавжди залиша,<br>І всихає коріння його українське.<br>А в мого солов’я – незрадлива  душа,<br>І батьківська любов, і пісні материнські.<br><br>Батьківщина моя - батьківщина його, <br>Ми серцями рідня, і не тільки на слові,<br>Скрізь вчувається спів соловейка мого,<br>Навіть в тихих словах його ніжної мови.<br><br>Кожен любить життя, свій батьківський поріг,<br>Хтось, можливо, обожнює іншу людину,<br>Когось вабить незвідана далеч доріг,<br>Я ж закохана в пісню одну солов’їну.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat1num4() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Красивий край з безмежністю степів. <br>Де стрічкою – ріка блакитнолиця. <br>Кулинина гора, Біла криниця, <br>Немов жарини – квіти воронців. <br><br>Де пахне терпко жито і полин, <br>Де сонях – вслід за сонцем повертає. <br>Край Марківській! Для мене ти – один. <br>Ріднішого і кращого немає!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat1num5() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Навесні увібралась калиною, <br>І барвінком, і рутою-м’ятою. <br>Я у серці – завжди з Україною, <br>Як із благословенням матері! <br><br>Я з безмірною в серці надією: <br>Буде мир на полях з териконами! <br>Бути миру! В це свято вірю я! <br>Чуєш, небо?! Озвися дзвонами! <br><br>…Мама схилиться над колискою <br>Із турботою ніжно-одвічною. <br>Буде тиша… і степ заквітчаний… <br>Україна знов стане піснею!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat1num6() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Вінок моєї України <br>З добра, надії і любові.<br>І туга матері за сином<br>У ньому, й стебла ковилові,<br><br>І  журавлів  ключі  журливі, <br>І мовчазливі тайни часу,<br>Холодні струни в літній зливі,<br>Які безжально сонце гасять.<br><br>На сивій дідівській могилі <br>Кущі квітучої калини,<br>Барвінки сині, маки спілі -<br>Вінок моєї України…');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

// copyright: Shevchenko Nazar

function show_cat2num1() {

	$('.poem').html('<span class="title-poem">Ранкова молитва</span><br>Почався ранок зі степів і трав.<br>Я на схід сонця уклонюсь доземно: <br>- Благослови, мій Боже, рідну землю, <br>Благослови цей день, що вже настав. <br><br>Хай буде мир. І сонце. І тепло. <br>І тато, й мама, дідусі й бабусі. <br>Я на схід сонця ще раз уклонюся, <br>Душею без останку розчинюся <br>В безмежжі тихім степових долонь.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num2() {

	$('.poem').html('<span class="title-poem">Сад</span>Люблю наш сад, де запах стиглих слив,<br>А одаль – пізніх трав п’янкі покоси…<br>Тут соловей востаннє полюбив <br>Й поніс свою любов у тиху осінь.<br><br>…Навис туман, схилився частокіл.<br>Іще одне пішло за обрій літо.<br>Люблю цей сад, старенький сад батьків,-<br>Колись онукам скажуть наші діти.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num4() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Зазирало небо у калюжі,<br>Грала ніч за нотами весни,<br>І блукали безпритульні сни,<br>Певно, нічиї, якісь байдужі.<br><br>Тліли на вогні вітрів слова,<br>І летіли вгору зорі-іскри,<br>І шуміла росами трава,<br>Прослана на землю низько-низько.<br><br>Тихий праліс стомлено дрімав,<br>А в туманом усланій долині<br>Квітень так невпевнено збирав<br>Проліски й зірки барвінків синіх.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num5() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Крізь сльози дощу посміхається заспане небо,<br>І густо притрушує вересень щастям цю мить.<br>А сонця тепло, щедро наткане літом для тебе,<br>Не скоро, не скоро тепер зможе серце зігріть.<br><br>Підняв догори дуб старезний жилаві долоні,<br>На вицвілі трави із нього посунулась тінь.<br>Розтріпує вітер від крапель посивілі скроні,<br>В них вплетені мрії й прадавні думки поколінь.<br><br>А яблунька-осінь запрошує стрічних гостинно<br>Достиглих плодів скуштувати прозорі меди.<br>Заплуталось бабине літо в чіпкім павутинні,<br>На стежці дощ змив його світлі останні сліди.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num6() {

	$('.poem').html('<span class="title-poem">Шумлять ліси</span><br>Шумлять ліси, шумлять зеленим листом<br>І мріють в надвечір’ях гомінких<br>Про тайні сни дубів широколистих<br>Мені шепочуть кленові гілки.<br><br>Шумлять ліси, стрічають ранки спілі,<br>Духмяні, теплі, літні, дощові.<br>Пливуть повз них човнами хмари білі<br>І гублять краплі неба у траві.<br><br>Шумлять ліси, в їх шумі – мудрість світу,<br>Туман на кронах – наче сивина…<br>Щось мимохідь гука деревам вітер,<br>Так голосно,що котиться луна.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num7() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Зів’яли зламані айстри<br>В надбитому глекові.<br>Вже осінь…<br>Вітер, очі сховавши,<br>Простягає долоні,<br>Щось просить.<br>А дощ торгує совістю<br>На безкінечній ярмарці<br>Людних вулиць.<br>Погляну в небо й відчую:<br>Для нього все, що минуло,<br>Забулось.<br>А осінь, ранена осінь,<br>Дощем холодним зализує<br>Листя-рани.<br>І тільки тепло квітів<br>В надбитому глекові<br>Манить…');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num8() {

	$('.poem').html('<span class="title-poem">Ромашкове</span><br>Серпневий степ нам простягав долоні<br>І дивувався ранок: як так вийшло,<br>Що з пелюсток ромашкових принишклих<br>Роса стікає краплями солоними...<br>А квіти ще не вірили. Зіщулились.<br>Їх вперше дарували, не зірвавши.<br>…Взяла. Усі. Тепер вагаюсь: нащо.<br>Лиш оберемком – може вже й забулося б…<br><br>Бо так – не всохнуть і не одцвітуть.<br>Нехай тепер, узимку, дуже важко, -<br>Вже скоро… Скоро знову ці ромашки<br>В степу красивим смутком проростуть,<br><br>Й серпневі зливи знову, як колись,<br>Ділитимуть із нами літню тишу,<br>І з пелюсток ромашкових принишклих<br>Змиватимуть солоні краплі сліз.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num9() {

	$('.poem').html('<span class="title-poem">Пісня «Осіння»</span><br>Вишнева гілка стука у вікно,<br>Як плаче листопад дощем ледь чути,<br>Сумує осінь…Тільки все одно<br>Люблю її очей чарівний смуток.<br><br>Ключ журавлів розділить навпіл даль,<br>Свою долоню у твоїй зігрію,<br>І нам з тобою не страшна печаль,<br>На щастя, осінь теж любити вміє.<br><br>Вишнева гілка тихо зронить лист,<br>Ключ журавлів за обрієм розтане…<br>За те, що ми в цій осені знайшлись,<br>Любити осінь я не перестану…');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat2num10() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Простір піснею жайвора зшитий,<br>Не обмежений степом нескошеним,<br>Крихти сонця скупались у житові,<br>Небо в косах зів’яло волошками,<br><br>Обвінчалась із полем душа моя,<br>Ковила заспівала весільної,<br>Уклонившись доземно, із шаною<br>Полудневі передосінньому…');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat3num1() {

	$('.poem').html('<span class="title-poem">Бурштин сходу</span><br>І хлипав дощик. І сивів полин. <br>Луною в серці стугоніли кроки . <br>Ти йшов, дорослий мій маленький син, <br>Бо хтось лихий зловісне кинув око <br>На колосків твоїх святий бурштин. <br><br>І степ стогнав. Із диким болем він <br>Окопи дозволяв робить на тілі. <br>Ми думали, не злічимо й годин, <br>Та бачте як: роки вже пролетіли, <br>А ми все стоїмо за свій бурштин. <br><br>Вам, знаєте, всі кажуть як один, <br>А гляньте в очі мам, то слів не треба: <br>Бурштин степів під тишею у небі - <br>То найдорожчий у Всесвіті бурштин. <br>…Лиш плям маку крізь німий полин… <br>Мій син…');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat3num2() {

	$('.poem').html('<span class="title-poem">* * *</span><br>У степів моїх рани глибокі.<br>Важко буде їх гоїти часові.<br>І не змити струмкам синьооким<br>Плям червоних на травах Донбасу.<br><br>Стільки вже терикони оплакали...<br>Скільки хлібні поля ще тужитимуть?!..<br>Поростуть воронцями і маками,<br>Ковилою від туги сивітимуть…<br><br>...І летітимуть в вирій лелеками,<br>І з небес нам світитимуть зорями,<br>Неосяжними і далекими,<br>Ті, кого назвемо ми героями…<br><br>А могли би назвати татами,<br>Чи синами, братами, коханими!..<br>Тих, хто є непоправню втратою<br>І степів моїх вічними ранами…');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat3num3() {

	$('.poem').html('<span class="title-poem">Ветеранам</span><br>Їх серця скалічені війною,<br>І нерідко в спогадах вони<br>Бачать миті нелегкого бою<br>І стежки запеклої війни.<br><br>Полотно ранкового туману <br>І трава нескошених степів,<br>Біль від незагоєної рани,<br>Лист додому. В ньому кілька слів.<br><br>Вибух знову котиться луною,<br>Пил їдкий від стоптаних доріг.<br>Скільки їх, скалічених війною!<br>Скільки їх залишилося в живих…<br><br>Вам спасибі ми сьогодні кажем<br>За любов, за сонячне тепло,<br>Бо якби не перемога ваша,<br>Може, й нас сьогодні не було б.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat3num4() {

	$('.poem').html('<span class="title-poem">Літо в степу</span><br>Пізня осінь. Мій степ заснув.<br>Ледь пульсують лиш ріки-вени.<br>Степ просив:<br>- Напиши про війну.<br>Й тихо так:<br>- Напиши про мене...<br><br>- Про війну напиши! - степ просив.<br>- Хай не кажуть: її тут немає!<br>- Хлопці гинуть! - зривався,<br>- Хай знають!<br>Сил нема вже! Немає сил...<br><br>Я ж і так!.. - степ зітхнув,<br>- Стільки міг...<br>Все,що міг... Але знов - гармати!<br>Хлопці... Діти ж чекають на них!<br>І слізьми умивається мати...<br><br>Степ замовк. І тривожно заснув.<br>...На гілках іще повно терну.<br>Степ просив:<br>- Напиши про весну.<br>І про мир. І про тишу. Й про мене...');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num1() {

	$('.poem').html('<span class="title-poem">У малих долоньках помістилося літо!</span><br>Любі мої донечки,<br>Після гарних снів<br>Намалюю сонечко<br>В вашому вікні.<br><br>Синочку маленький мій!<br>Небо пригорну.<br>З раночку-раненького<br>Й допізна, до сну...<br><br>А як сон ходитиме<br>Біля хати вже,<br>Господа молитиму:<br>Хай їх береже.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num2() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Нам же, дітям, небагато треба:<br>Поруч мама й тато. Лiто в соняхах.<br>Сніжні зими. І безхмарне небо.<br>Тихе небо, а не тільки сонячне.<br><br>Хай сміється травень дзвінко й весело,<br>Ще й юрба метеликів - між квітами!<br>Хай почує й зрозуміє Всесвіт:<br>Мирного дитинства хочуть діти!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num3() {

	$('.poem').html('<span class="title-poem">Веселка</span><br>Знаєш, що таке веселка?<br>Я так думаю, що, може,<br>Її янголи далекі<br>В день малюють непогожий.<br><br>Як проплаче з хмари дощик,<br>Вони так собі гадають:<br>- Намалюємо! Хоч трошки<br>Хай усіх розвеселяє!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}
	
}

function show_cat4num4() {

	$('.poem').html('<span class="title-poem">На святвечір</span><br>Різдвяна зірка блиснула над хатою.<br>Пора! Біжим! І ось вже стук у двері:<br>-Бабусю, можна заколядувати?<br>Ми принесли тобі святу вечерю!<br><br>Кутя у нас солодка і багата.<br>Здорові будьте з дідусем, щасливі…<br>Та більше всього хочем побажати<br>Усім нам миру…');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num5() {

	$('.poem').html('<span class="title-poem">Літо у долоньці</span><br>У моїй долоньці –<br>Цяточка-краплинка.<br>Золотисте сонце<br>В ній, пухка хмаринка,<br>Листячко зелене<br>І дрібненькі квіти.<br>У долоньці в мене<br>Помістилось літо!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num6() {

	$('.poem').html('<span class="title-poem">Соловейку у саду</span><br>Соловейку у саду<br>Геть не до пісень!<br>Плаче, наче на біду,<br>Хмарка цілий день!<br><br>Квіточкам – нема біди!<br>Навпаки якраз:<br>Повні пригорщі води,<br>(Щоб і про запас).<br><br>І нанизують в траві<br>На тонкі нитки<br>Всі краплинки дощові<br>Сірі павучки.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num7() {

	$('.poem').html('<span class="title-poem">Забарилася зима</span><br>Забарилася зима,-<br>Скаржилася осінь.<br>Сніг пустився, та й нема!<br>Ліс не спить і досі.<br><br>Знову гриб рости почав<br>(Дощиків багато!).<br>Та не втямить лиш зайча:<br>В що ж йому вбиратись.<br><br>І тому чи не щодня<br>Зайченятко бідне<br>Кожушки свої міня,<br>Щоб не буть помітним.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num8() {

	$('.poem').html('<span class="title-poem">* * *</span><br>- Це кому вночі не спиться?<br>Хто у мене у садку<br>Понадкушував суниці?<br>Обізвися, шкіднику!<br><br>- Вибач, чується з городу, -<br>Я не звик робити шкоду…<br>То був равлик. І додав:<br>- Але ж як посмакував!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num9() {

	$('.poem').html('<span class="title-poem">* * *</span> <br> У калюжах – небо чисте,<br>Під ногами – зорі, зорі…<br>А між ними – жовте листя,<br>Як кораблики у морі.<br><br>Дощ змочив берізці плечі,<br>Їй з тонкого павутиння<br>Гарний шалик в’яже вечір.<br>На добраніч, день осінній!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num10() {

	$('.poem').html('<span class="title-poem">Новорічне свято</span><br>В нас ялиночка красива,<br>Вогників багато.<br>І чекають казки-дива<br>Навіть мама з татом.<br><br>У Мороза вуса білі,<br>Чарівні санчата.<br>Зможе він й без заметілі<br>В них до нас примчати!<br><br>В вікна казка заглядає,<br>Проситься до хати.<br>Вся родина зустрічає<br>Новорічне свято!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}


function show_cat4num11() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Біля стежки сонно-сонно<br>Позіха лапатий сонях.<br>- Добрий ранок! - сіла пташка,<br>- Прокидатись – це ж неважко!<br>Як піднятись, потягнутись,<br>Вмитись, сонечку всміхнутись!<br><br>Підморгнула хмарка з неба:<br>- А іще вітатись треба,<br>І тоді не тільки ранок –<br>Цілий день хорошим стане!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num12() {

	$('.poem').html('<span class="title-poem">Лист Святому Миколаю</span><br>Святий Миколаю!<br>Здоров’я прохаю<br>Дорослим і дітям<br>У цілому світі.<br><br>Ти щедрий, багатий,<br>Хай кожен на свято<br>Отримає те,<br>Що хотів дуже мати:<br><br>Цукерку, чи іграшку<br>навіть можливо.<br>Хай будуть всі діти<br>Здорові й щасливі.<br><br>Хай радісно свято<br>Стрічає родина.<br>Порадуй, будь ласочка,<br>Кожну дитину!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num13() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Осінь. Поринає ліс у сни.<br>Їжачкам гілки струсили листя.<br>Лиш калини та горобини<br>Хоч нема листків, та є намисто.<br><br>Як зима вже стане на порі,<br>Прилетять до неї на гостини<br>І червоногруді снігурі,<br>І синички, й ще яка пташина…<br><br>Щедро частуватимуть тоді<br>Їх в голодну і важку годину<br>І не жалкуватимуть плодів<br>Лісова горобина й калина.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num14() {

	$('.poem').html('<span class="title-poem">Літо любить працьовитих</span><br>Бджілка – з квіточки на квітку:<br>Спочивать негоже влітку!<br>Із акації медок,<br>З липки запашних квіток,<br><br>Із ромашок, конюшини<br>Мед солодкий для родини.<br>А ви знали, любі діти?<br>Літо любить працьовитих!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num15() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Мій друже клен, підкрався листопад.<br>І день, і ніч гуля холодний вітер.<br>Он, бачиш, помарнів вишневий сад,<br>А он в берізки майже голі віти…<br><br>Тремтять листочки кленові дарма,<br>М’якеньким светром за ніч землю встелять<br>Й чекатимуть, допоки вже зима<br>І клен, і ті листочки захурделить.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num16() {

	$('.poem').html('<span class="title-poem">Подарунок від Миколая</span><br>Я знаю: у Святого Миколая<br>Роботи у святкові дні багато.<br>І знаю те, що не завжди встигає<br>Дарунками усіх він привітати.<br><br>- Відправ, допоможи, - прохаю тата, -<br>Без підпису цей поштою пакунок.<br>Нехай подума захисник, мій братик,<br>Що то від Миколайчика дарунок!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num17() {

	$('.poem').html('<span class="title-poem">* * *</span><br>За вікном хурделиця,<br>Біла завірюха.<br>Сніг пухнастий стелиться,<br>Вітер в шибку дмуха.<br><br>Та малечі у теплі<br>Всидіть – де там, годі!<br>Зачекалися малі<br>Сніжної погоди.<br><br>Вітру не лякаються<br>Хлопчики й дівчатка<br>Весело спускаються<br>З гірки на санчатах!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num18() {

	$('.poem').html('<span class="title-poem">Коляда!</span><br>Вже весела коляда<br>В вікна щастям загляда,<br>А свята вечеря<br>Стукає у двері.<br><br>Будьте всі здорові!<br>Із Різдвом Христовим!<br>Живіть, не сумуйте,<br>Нас скоріш частуйте!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num19() {

	$('.poem').html('<span class="title-poem">Море квітів</span><br>Поле – море. Море квітів.<br>А метелики малі<br>На тоненьких хвилях листя<br>Як барвисті кораблі.<br><br>Тріпотять строкаті крильця<br>У ромашок пелюстках,<br>Наче напнуті вітрильця<br>На казкових кораблях.');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num20() {

	$('.poem').html('<span class="title-poem">Треба жити у любові (Казка)</span><br>Двоє зайчиків вухатих<br>У яскравих штанцях<br>На галявину пограти<br>Вийшли рано-вранці.<br>Каже мама:<br>- Не баріться!<br>Трішки – та й до хати!<br>Будьте чемні, не сваріться,<br>Дітки-зайченята!<br>Ген наввипередки мчали<br>Стільки стало сили!<br>І сміялись, і стрибали…<br>Й равлика зустріли.<br>Жив неподалік він, в лузі,<br>Поруч із зайчатами.<br>- Добрий ранок, мовив, друзі!<br>Будем разом грати?<br>А бешкетники вухаті:<br>- Насмішив ти, друже,<br>Як ми будем разом грати?<br>Ти ж повільний дуже!<br><br>Равлик з суму ледь не плаче,<br>Бо образа – лихо!<br>Те все їжачок побачив<br>І промовив тихо:<br>- Ми всі різні і несхожі,<br>Правда це, звірята,<br>Та сваритися негоже<br>Й інших ображати.<br>Зайченята помарніли:<br>- Друже, равлику, не плач,<br>Ми провину зрозуміли,<br>Ти нас, просимо, пробач!<br>- Добре, - равлик посміхнувся,<br>І всміхнувсь довкола ліс.<br>Їжачок додав:<br>- Я друзям<br>Яблучок смачних приніс!<br>Й частувалися малята,<br>Дякували їжачкові.<br>То негарно – ображати.<br>Треба жити у любові!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num21() {

	$('.poem').html('<span class="title-poem">Треба бути працьовитим (Казка)</span><br>Із малесенької хатки –<br>Із гарненького яєчка<br>Вдень з’явилося курчатко<br>(Та й допитлива ж малеча!)<br><br>Все було йому цікаво,<br>Все воно хотіло знати!<br>- Здрастуй, синку мій, - ласкаво<br>Мовив крихті півник-тато.<br><br>- Здрастуй! – Крильцями-руками<br>Потягнулося невміло.<br>…На подвір’ї – шум і гамір,<br>І у кожного є діло.<br><br>- Тату, хто це? Що то, татку?<br>А он там? А це для чого? –<br>Так знайомилось курчатко<br>З світом ще новим для нього.<br><br>І пояснює все татко,<br>Малюка свого повчає:<br>- Старанно шукай зернятка,<br>І збирай, як я збираю.<br><br>Треба, синку мій, привчатись<br>Ще із малку до порядку,<br>І по силі працювати, -<br>Так навчав татусь курчатко.<br><br>Та курчатко лінькувате<br>Схоже слухатись не хоче:<br>- Не збиратиму зерняток!<br>Краще гратимусь в садочку!<br><br>Тато посміхнувсь:<br>- Як знаєш.<br>Ось і вечір. Час спочити.<br>Та курчатко не дрімає:<br>Хоче їсти! Хоче пити!<br><br>Через лінь свою сьогодні<br>Це курчатко необачне<br>Залишилося голодним<br>І заледве вже не плаче.<br><br>Роботящий тато-півник<br>Те помітив і охоче<br>Назбирав дрібних зернинок,<br>В дзьобику приніс синочку,<br><br>Із колодязя водички<br>Дав напитися курчатці.<br>І промовив:<br>- Не годиться,<br>Бачиш, синку, лінуваться!<br>- Ой, спасибі, любий тату,<br>За науку, за повчання,<br>Вже не буду лінуватись,<br>Всім пораджу на прощання:<br><br>Ви затямте, любі діти,<br>Треба бути працьовитим!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}

function show_cat4num22() {

	$('.poem').html('<span class="title-poem">Переддень Святого Миколая або Як Марійка з друзями Диво рятували (Казка)</span><br>За день до Миколая сипав сніг.<br>Хурделиця така – не видно й світу!<br>По всій країні у хатах своїх<br>Чекали нетерпляче Дива діти.<br><br>Марійка – теж. А з нею Кіт Муркіт<br>(він був із тих котів, що вірять в Диво).<br>Озвався Пес Дружок біля воріт:<br>- Сюди, Марійко, Коте! Це важливо!<br><br>Вони, вдягнувшись, взувшись – ген надвір.<br>- Ну що тут?<br>- Лихо, - мовить Пес, - Це лихо!<br>Лисички бігли, кажуть: вір-не-вір,<br>А Миколай не прийде через Віхолу!<br><br>- Аго-о-о-ов! Руді-і-і-і! Чи так насправді все?<br>Лисички враз почули і прибігли:<br>- Та всіх у лісі скоро занесе!<br>Вже на стежках по пояс майже снігу!<br><br>- То що ж робити?<br>Вуса Кіт потер:<br>- Олені чарівні живуть у хащах.<br>І щось мені підказує тепер,<br>Без них не обійтися нам нізащо…<br><br>- Та хто ж їх знайде?<br>Каже Зайчик:<br>- Я!<br>- А ти де взявсь?<br>- Почув розмову вашу.<br>Хай допоможе спритність вам моя.<br>Гуртом же рятувати Диво краще!<br><br>- А поки що ліхтарик візьмем ми<br>І, мур, з клубочка ниточку м’якеньку!<br>Ми з ними навіть посеред зими<br>Доріжку разом знайдемо швиденько!<br><br>- Гаразд! Біжим!<br>…А лісом йшов Святий.<br>Дарунки дітям ніс. Стомився трішки.<br>Аж раптом глянув: як же шлях знайти?<br>Геть замела Хурделиця доріжки!<br><br>І важко так, бо за плечима – міх,<br>І грузне Сивий в сніг по пояс майже…<br>А Віхола все сипле, сипле сніг…<br>- Не дочекаєтесь ви Дива, - каже.<br><br>І зажурився навіть Миколай.<br><br>- О-хо… Мене ж чекає стільки діток!<br>- Діду-усю-у-у! – раптом чує, - Пострива-а-а-ай!<br>І – здалеку ледь видно цятку світла.<br><br>То йдуть Марійка, Кіт і Пес Дружок,<br>Авжеж із ними й дві рудих Хитрунки.<br>Із ліхтарем, в руках м’який клубок.<br>До Дідуся, що всім несе дарунки.<br><br>- Ви де? Ви де? – гукає Зайченя.<br>Олені ось! І радо допоможуть!<br>Бо ж Диво в дім приходить не щодня,<br>На нього так чека дитина кожна!<br><br>- Які ви молодці! – Дідусь зрадів.<br>- То ж ми спішили рятувати Диво!<br>- Та не мої дарунки – Диво з Див,<br>А те, що дружні ви такі й сміливі!!!<br>Вони в санчата переклали міх<br>Й по ниточці з клубка пішли щасливо…<br>…Хай Віхола жбурляла вслід їм сніг,<br>Та дітлахи все ж дочекалися Дива!');
	if( $('.poem').css('margin-top') == '50px' ) {
		$('body').scrollTo('.poem', 500);
	}

}
