function open_menu() {

	$('.menu').toggleClass('menu_active');
	$('.menu_button').toggleClass('mbutton_active');

}

function sel_sect_1() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat1num1()">cat1_num1</span><br><span onclick="show_cat1num2()">cat1-num2</span><br><span onclick="show_cat1num3()">cat1-num3</span><br><span onclick="show_cat1num4()">cat1-num4</span>');

}

function sel_sect_2() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat2num1()">cat2_num1</span><br><span onclick="show_cat2num2()">cat2-num2</span><br><span onclick="show_cat2num3()">cat2-num3</span><br><span onclick="show_cat2num4()">cat2-num4</span>');

}

function sel_sect_3() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat3num1()">cat3_num1</span><br><span onclick="show_cat3num2()">cat3-num2</span><br><span onclick="show_cat3num3()">cat3-num3</span><br><span onclick="show_cat3num4()">cat3-num4</span>');

}

function sel_sect_4() {

	$('.poems_list').html('<span onclick="to_start()">Назад</span><br><span onclick="show_cat4num1()">У малих долоньках помістилося літо!</span><br><span onclick="show_cat4num2()">Нам же, дітям</span><br><span onclick="show_cat4num3()">Веселка</span><br><span onclick="show_cat4num4()">На святвечір</span><br><span onclick="show_cat4num5()">Літо у долоньці</span><br><span onclick="show_cat4num6()">Соловейку у саду</span><br><span onclick="show_cat4num7()">Забарилася зима</span><br><span onclick="show_cat4num8()">Це кому вночі не спиться?</span><br><span onclick="show_cat4num9()">У калюжах – небо чисте</span><br><span onclick="show_cat4num10()">Новорічне свято</span><br><span onclick="show_cat4num11()">Біля стежки сонно-сонно</span><br><span onclick="show_cat4num12()">Лист Святому Миколаю</span><br><span onclick="show_cat4num13()">Осінь</span><br><span onclick="show_cat4num14()">Літо любить працьовитих</span><br><span onclick="show_cat4num15()">Мій друже клен</span><br><span onclick="show_cat4num16()">Подарунок від Миколая</span><br><span onclick="show_cat4num17()">За вікном хурделиця</span><br><span onclick="show_cat4num18()">Коляда!</span><br><span onclick="show_cat4num19()">Море квітів</span><br><span onclick="show_cat4num20()">Треба жити у любові (Казка)</span><br><span onclick="show_cat4num21()">Треба бути працьовитим (Казка)</span><br><span onclick="show_cat4num22()">Переддень Святого Миколая або Як Марійка з друзями Диво рятували (Казка)</span>');

}

function to_start() {

	$('.poems_list').html('<span onclick="sel_sect_1()"><span class="poem-font">"Мій милий край з безмежністю степів"</span><br>(поезія про Україну та малу батьківщину)</span> <br><span onclick="sel_sect_2()"><span class="poem-font">"Вишнева гілка стука у вікно"</span><br>(пейзажна лірика)</span> <br><span onclick="sel_sect_3()"><span class="poem-font">"Їх серця скалічені війною"</span><br>()</span> <br><span onclick="sel_sect_4()"><span class="poem-font">"У малих долоньках помістилося літо"</span><br>(твори для дітей)</span>');

}

function show_cat1num1() {

	$('.poem').html('Ви обрали вірш! 1');

}

function show_cat1num2() {

	$('.poem').html('Ви обрали вірш! 2');

}

function show_cat1num3() {

	$('.poem').html('Ви обрали вірш! 3');

}

// copyright: Shevchenko Nazar

function show_cat1num4() {

	$('.poem').html('Ви обрали вірш! 4');

}

function show_cat2num1() {

	$('.poem').html('Ви обрали вірш! 5');

}

function show_cat2num2() {

	$('.poem').html('Ви обрали вірш! 6');

}

function show_cat2num3() {

	$('.poem').html('Ви обрали вірш! 7');

}

function show_cat2num4() {

	$('.poem').html('Ви обрали вірш! 8');

}

function show_cat3num1() {

	$('.poem').html('Ви обрали вірш! 9');

}

function show_cat3num2() {

	$('.poem').html('Ви обрали вірш! 10');

}

function show_cat3num3() {

	$('.poem').html('Ви обрали вірш! 11');

}

function show_cat3num4() {

	$('.poem').html('Ви обрали вірш! 12');

}

function show_cat4num1() {

	$('.poem').html('<span class="title-poem">У малих долоньках помістилося літо!</span><br>Любі мої донечки,<br>Після гарних снів<br>Намалюю сонечко<br>В вашому вікні.<br><br>Синочку маленький мій!<br>Небо пригорну.<br>З раночку-раненького<br>Й допізна, до сну...<br><br>А як сон ходитиме<br>Біля хати вже,<br>Господа молитиму:<br>Хай їх береже.<br><br>Синочку маленький мій!<br>Небо пригорну.<br>З раночку-раненького<br>Й допізна, до сну.<br><br>А як сон ходитиме<br>Біля хати вже,<br>Господа молитиму: <br> Хай їх береже.');

}

function show_cat4num2() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Нам же, дітям, небагато треба:<br>Поруч мама й тато.<br>Лiто в соняхах.<br>Сніжні зими.<br><br>І безхмарне небо.<br>Тихе небо, а не тільки сонячне.<br>Хай сміється травень дзвінко й весело,<br><br>Ще й юрба метеликів<br>Хай почує й зрозуміє Всесвіт:<br>Мирного дитинства хочуть діти!<br>Між квітами!');

}

function show_cat4num3() {

	$('.poem').html('<span class="title-poem">Веселка</span><br>Знаєш, що таке веселка?<br>Я так думаю, що, може,<br>Її янголи далекі<br>В день малюють непогожий.<br><br>Як проплаче з хмари дощик,<br>Вони так собі гадають:<br>- Намалюємо! Хоч трошки<br>Хай усіх розвеселяє!');

}

function show_cat4num4() {

	$('.poem').html('<span class="title-poem">На святвечір</span><br>Різдвяна зірка блиснула над хатою.<br>Пора! Біжим! І ось вже стук у двері:<br>-Бабусю, можна заколядувати?<br>Ми принесли тобі святу вечерю!<br><br>Кутя у нас солодка і багата.<br>Здорові будьте з дідусем, щасливі…<br>Та більше всього хочем побажати<br>Усім нам миру…');

}

function show_cat4num5() {

	$('.poem').html('<span class="title-poem">Літо у долоньці</span><br>У моїй долоньці –<br>Цяточка-краплинка.<br>Золотисте сонце<br>В ній, пухка хмаринка,<br><br>Листячко зелене<br>І дрібненькі квіти.<br>У долоньці в мене<br>Помістилось літо!');

}

function show_cat4num6() {

	$('.poem').html('<span class="title-poem">Соловейку у саду</span> <br>Соловейку у саду<br>Геть не до пісень!<br>Плаче, наче на біду,<br>Хмарка цілий день!<br><br>Квіточкам – нема біди!<br>Навпаки якраз:<br>Повні пригорщі води,<br>(Щоб і про запас).<br><br>І нанизують в траві<br>На тонкі нитки<br>Всі краплинки дощові<br>Сірі павучки.');

}

function show_cat4num7() {

	$('.poem').html('<span class="title-poem">Забарилася зима</span><br>Забарилася зима,-<br>Скаржилася осінь.<br>Сніг пустився, та й нема!<br>Ліс не спить і досі.<br><br>Знову гриб рости почав<br>(Дощиків багато!).<br>Та не втямить лиш зайча:<br>В що ж йому вбиратись.<br><br>І тому чи не щодня<br>Зайченятко бідне<br>Кожушки свої міня,<br>Щоб не буть помітним.');

}

function show_cat4num8() {

	$('.poem').html('<span class="title-poem">* * *</span><br>- Це кому вночі не спиться?<br>Хто у мене у садку<br>Понадкушував суниці?<br>Обізвися, шкіднику!<br><br>- Вибач, чується з городу, -<br>Я не звик робити шкоду…<br>То був равлик. І додав:<br>- Але ж як посмакував!');

}

function show_cat4num9() {

	$('.poem').html('<span class="title-poem">* * *</span> <br> У калюжах – небо чисте,<br>Під ногами – зорі, зорі…<br>А між ними – жовте листя,<br>Як кораблики у морі.<br><br>Дощ змочив берізці плечі,<br>Їй з тонкого павутиння<br>Гарний шалик в’яже вечір.<br>На добраніч, день осінній!');

}

function show_cat4num() {

	$('.poem').html('span.title-poem{}<br>');

}

function show_cat4num10() {

	$('.poem').html('<span class="title-poem">Новорічне свято</span><br>В нас ялиночка красива,<br>Вогників багато.<br>І чекають казки-дива<br>Навіть мама з татом.<br><br>У Мороза вуса білі,<br>Чарівні санчата.<br>Зможе він й без заметілі<br>В них до нас примчати!<br><br>В вікна казка заглядає,<br>Проситься до хати.<br>Вся родина зустрічає свято!');

}


function show_cat4num11() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Біля стежки сонно-сонно<br>Позіха лапатий сонях.<br>- Добрий ранок!, - сіла пташка,<br>- Прокидатись – це ж неважко!<br><br>Як піднятись, потягнутись,<br>Вмитись, сонечку всміхнутись!<br>Підморгнула хмарка з неба:<br>- А іще вітатись треба,<br><br>І тоді не тільки ранок –<br>Цілий день хорошим стане!');

}

function show_cat4num12() {

	$('.poem').html('<span class="title-poem">Лист Святому Миколаю</span><br>Святий Миколаю!<br>Здоров’я прохаю<br>Дорослим і дітям<br>У цілому світі.<br><br>Ти щедрий, багатий,<br>Хай кожен на свято<br>Отримає те,<br>Що хотів дуже мати:<br><br>Цукерку, чи іграшку<br>навіть можливо.<br>Хай будуть всі діти<br>Здорові й щасливі.<br><br>Хай радісно свято<br>Стрічає родина.<br>Порадуй, будь ласочка,<br>Кожну дитину!');

}

function show_cat4num13() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Осінь. Поринає ліс у сни.<br>Їжачкам гілки струсили листя.<br>Лиш калини та горобини<br>Хоч нема листків, та є намисто.<br><br>Як зима вже стане на порі,<br>Прилетять до неї на гостини<br>І червоногруді снігурі,<br>І синички, й ще яка пташина…<br><br>Щедро частуватимуть тоді<br>Їх в голодну і важку годину<br>І не жалкуватимуть плодів<br>Лісова горобина й калина.');

}

function show_cat4num14() {

	$('.poem').html('<span class="title-poem">Літо любить працьовитих</span><br>Бджілка – з квіточки на квітку:<br>Спочивать негоже влітку!<br>Із акації медок,<br>З липки запашних квіток,<br><br>Із ромашок, конюшини<br>Мед солодкий для родини.<br>А ви знали, любі діти?<br>Літо любить працьовитих!');

}

function show_cat4num15() {

	$('.poem').html('<span class="title-poem">* * *</span><br>Мій друже клен, підкрався листопад.<br>І день, і ніч гуля холодний вітер.<br>Он, бачиш, помарнів вишневий сад,<br>А он в берізки майже голі віти…<br><br>Тремтять листочки кленові дарма,<br>М’якеньким светром за ніч землю встелять<br>Й чекатимуть, допоки вже зима<br>І клен, і ті листочки захурделить.');

}

function show_cat4num16() {

	$('.poem').html('<span class="title-poem">Подарунок від Миколая</span><br>Я знаю: у Святого Миколая<br>Роботи у святкові дні багато.<br>І знаю те, що не завжди встигає<br>Дарунками усіх він привітати.<br><br>- Відправ, допоможи, - прохаю тата, -<br>Без підпису цей поштою пакунок.<br>Нехай подума захисник, мій братик,<br>Що то від Миколайчика дарунок!');

}

function show_cat4num17() {

	$('.poem').html('<span class="title-poem">* * *</span><br>За вікном хурделиця,<br>Біла завірюха.<br>Сніг пухнастий стелиться,<br>Вітер в шибку дмуха.<br><br>Та малечі у теплі<br>Всидіть – де там, годі!<br>Зачекалися малі<br>Сніжної погоди.<br><br>Вітру не лякаються<br>Хлопчики й дівчатка<br>Весело спускаються<br>З гірки на санчатах!');

}

function show_cat4num18() {

	$('.poem').html('<span class="title-poem">Коляда!</span><br>Вже весела коляда<br>В вікна щастям загляда,<br>А свята вечеря<br>Стукає у двері.<br><br>Будьте всі здорові!<br>Із Різдвом Христовим!<br>Живіть, не сумуйте,<br>Нас скоріш частуйте!');

}

function show_cat4num19() {

	$('.poem').html('<span class="title-poem">Море квітів</span><br>Поле – море. Море квітів.<br>А метелики малі<br>На тоненьких хвилях листя<br>Як барвисті кораблі.<br><br>Тріпотять строкаті крильця<br>У ромашок пелюстках,<br>Наче напнуті вітрильця<br>На казкових кораблях.');

}

function show_cat4num20() {

	$('.poem').html('<span class="title-poem">Треба жити у любові (Казка)</span><br>Двоє зайчиків вухатих<br>У яскравих штанцях<br>На галявину пограти<br>Вийшли рано-вранці.<br>Каже мама:<br>- Не баріться!<br>Трішки – та й до хати!<br>Будьте чемні, не сваріться,<br>Дітки-зайченята!<br>Ген наввипередки мчали<br>Стільки стало сили!<br>І сміялись, і стрибали…<br>Й равлика зустріли.<br>Жив неподалік він, в лузі,<br>Поруч із зайчатами.<br>- Добрий ранок, мовив, друзі!<br>Будем разом грати?<br>А бешкетники вухаті:<br>- Насмішив ти, друже,<br>Як ми будем разом грати?<br>Ти ж повільний дуже!<br><br>Равлик з суму ледь не плаче,<br>Бо образа – лихо!<br>Те все їжачок побачив<br>І промовив тихо:<br>- Ми всі різні і несхожі,<br>Правда це, звірята,<br>Та сваритися негоже<br>Й інших ображати.<br>Зайченята помарніли:<br>- Друже, равлику, не плач,<br>Ми провину зрозуміли,<br>Ти нас, просимо, пробач!<br>- Добре, - равлик посміхнувся,<br>І всміхнувсь довкола ліс.<br>Їжачок додав:<br>- Я друзям<br>Яблучок смачних приніс!<br>Й частувалися малята,<br>Дякували їжачкові.<br>То негарно – ображати.<br>Треба жити у любові!');

}

function show_cat4num21() {

	$('.poem').html('<span class="title-poem">Треба бути працьовитим (Казка)</span><br>Із малесенької хатки –<br>Із гарненького яєчка<br>Вдень з’явилося курчатко<br>(Та й допитлива ж малеча!)<br>Все було йому цікаво,<br>Все воно хотіло знати!<br>- Здрастуй, синку мій, - ласкаво<br><br>Мовив крихті півник-тато.<br>- Здрастуй! – Крильцями-руками<br>Потягнулося невміло.<br>…На подвір’ї – шум і гамір,<br>І у кожного є діло.<br>- Тату, хто це? Що то, татку?<br>А он там? А це для чого? –<br>Так знайомилось курчатко<br>З світом ще новим для нього.<br>І пояснює все татко,<br>Малюка свого повчає:<br>- Старанно шукай зернятка,<br>І збирай, як я збираю.<br>Треба, синку мій, привчатись<br>Ще із малку до порядку,<br>І по силі працювати, -<br>Так навчав татусь курчатко.<br>Та курчатко лінькувате<br>Схоже слухатись не хоче:<br>- Не збиратиму зерняток!<br>Краще гратимусь в садочку!<br>Тато посміхнувсь:<br>- Як знаєш.<br>Ось і вечір. Час спочити.<br>Та курчатко не дрімає:<br>Хоче їсти! Хоче пити!<br>Через лінь свою сьогодні<br>Це курчатко необачне<br>Залишилося голодним<br>І заледве вже не плаче.<br>Роботящий тато-півник<br><br>Те помітив і охоче<br>Назбирав дрібних зернинок,<br>В дзьобику приніс синочку,<br>Із колодязя водички<br>Дав напитися курчатці.<br>І промовив:<br>- Не годиться,<br>Бачиш, синку, лінуватися!<br>- Ой, спасибі, любий тату,<br>За науку, за повчання,<br>Вже не буду лінуватись,<br>Всім пораджу на прощання:<br>Ви затямте, любі діти,<br>Треба бути працьовитим!');

}

function show_cat4num22() {

	$('.poem').html('<span class="title-poem">Переддень Святого Миколая або Як Марійка з друзями Диво рятували (Казка)</span><br>За день до Миколая сипав сніг.<br>Хурделиця така – не видно й світу!<br>По всій країні у хатах своїх<br>Чекали нетерпляче Дива діти.<br>Марійка – теж. А з нею Кіт Муркіт<br>(він був із тих котів, що вірять в Диво).<br>Озвався Пес Дружок біля воріт:<br>- Сюди, Марійко, Коте! Це важливо!<br>Вони, вдягнувшись, взувшись – ген надвір.<br><br>- Ну що тут?<br><br>- Лихо, - мовить Пес, - Це лихо!<br><br>Лисички бігли, кажуть: вір-не-вір,<br>А Миколай не прийде через Віхолу!<br>- Аго-о-о-ов! Руді-і-і-і! Чи так насправді все?<br>Лисички враз почули і прибігли:<br>- Та всих у лісі скоро занесе!<br>Вже на стежках по пояс майже снігу!<br><br>- То що ж робити?<br>Вуса Кіт потер:<br><br>- Олені чарівні живуть у хащах.<br>І щось мені підказує тепер,<br>Без них не обійтися нам нізащо…<br>- Та хто ж їх знайде?<br>Каже Зайчик:<br>- Я!<br>- А ти де взявсь?<br>- Почув розмову вашу.<br>Хай допоможе спритність вам моя.<br>Гуртом же рятувати Диво краще!<br>- А поки що ліхтарик візьмем ми<br>І, мур, з клубочка ниточку м’якеньку!<br>Ми з ними навіть посеред зими<br>Доріжку разом знайдемо швиденько!<br><br>- Гаразд! Біжим!<br>…А лісом йшов Святий.<br>Дарунки дітям ніс. Стомився трішки.<br>Аж раптом глянув: як же шлях знайти?<br>Геть замела Хурделиця доріжки!<br>І важко так, бо за плечима – міх,<br>І грузне Сивий в сніг по пояс майже…<br>А Віхола все сипле, сипле сніг…<br>- Не дочекаєтесь ви Дива, - каже.<br>І зажурився навіть Миколай.<br><br>- О-хо… Мене ж чекає стільки діток!<br>- Діду-усю-у-у! – раптом чує, - Пострива-а-а-ай!<br>І – здалеку ледь видно цятку світла.<br>То йдуть Марійка, Кіт і Пес Дружок,<br>Авжеж із ними й дві рудих Хитрунки.<br>Із ліхтарем, в руках м’який клубок.<br>До Дідуся, що всім несе дарунки.<br>- Ви де? Ви де? – гукає Зайченя.<br>Олені ось! І радо допоможуть!<br>Бо ж Диво в дім приходить не щодня,<br>На нього так чека дитина кожна!<br>- Які ви молодці! – Дідусь зрадів.<br>- То ж ми спішили рятувати Диво!<br>- Та не мої дарунки – Диво з Див,<br>А те, що дружні ви такі й сміливі!!!<br>Вони в санчата переклали міх<br>Й по ниточці з клубка пішли щасливо…<br>…Хай Віхола жбурляла вслід їм сніг,<br>Та дітлахи все ж дочекалися Дива!');

}
